Repository: Ramblurr/Meedan-Open-Translation-Memory--ar-en-
Catalog: MeedanMeemory-2009JUL22.tmx
Source language: en
Languages: ar

source: It is worthwhile to mention that the party was incepted in February of 2009 immediately after Sheikh Sherif was brought into power on January 31. The party is comprised of four factions, namely “The Islamic Front”, “Ras Kamboni Brigade”, “Khaled Bin Wale
ar: ومن الجدير بالذكر أن الحزب الإسلامي الصومالي تأسس في بداية شهر فبراير الماضي، بعد انتخاب شيخ شريف رئيسا للصومال في 31 يناير 2009، ويضم الحزب أربع فصائل من فصائل المقاومة، هي: الجبهة الإسلامية، ومعسكر رأس كامبوني بقيادة حسن تركي، ومعسكر خالد بن الول

source: After one month of inauguration, the Islamic Party in Somalia faced divisions within members, ultimately resulting in leadership change. Sheikh Mohamed Hassan Ammi assumed power post Dr. Umar Ayman Abu Bakr’s resignation, due to unjustified battles condu
ar: وبعد شهر واحد فقط من تأسيسه، واجه الحزب الإسلامي الصومالي مشكلة تغير قيادته، حيث تولى الشيخ محمد حسن عمّي رئاسة الحزب بعد إقالة د.عمر إيمان أبو بكر؛ وذلك بسبب خوض الحزب معارك وصفت بأنها غير مبررة ضد حكومة الشيخ شريف والقوات الإفريقية العاملة في الصومال،

source: The new president has confirmed the party's dialogue with the Islam Online its commitment to the orders of the board of ulema in Somalia to stop fighting among the Somalis, and its readiness to cooperate with the new government, to abide by the applic
ar: وقد أكد الرئيس الجديد للحزب في حوار مع شبكة إسلام أون لاين التزامه بأوامر هيئة علماء الصومال في وقف الاقتتال بين الصوماليين، واستعداده للتعاون مع الحكومة الجديدة بشرط أن تلتزم بتطبيق الشريعة الإسلامية.

source: Chavez announces ambassador return to Washington
ar: تشافيز يعلن اعادة سفيره الى واشنطن

source: Venezuelan President, Hugo Chavez, announced Saturday the restoration of an ambassador to the United States. His decision was announced during the Summit of the Americas in Trinidad and Tobago.
ar: اعلن الرئيس الفنزويلي هوغو تشافيز السبت خلال قمة الاميركيتين في ترينيداد وتوباغو ان فنزويلا سترسل سفيرا الى الولايات المتحدة.

source: This announcement came post a brief meeting with US Secretary of State Hilary Clinton, after which Chavez declared the possibility of restoring an ambassador in the United States, stating Caracas’ willingness to work in this direction.
ar: وقال تشافيز بعد لقاء قصير مع وزيرة الخارجية الاميركية هيلاري كلينتون انه من الممكن التفكير في تعيين سفير في الولايات المتحدة، معبرا عن ارادة كراكاس العمل في هذا الاتجاه.

source: Chavez had kicked out the US ambassador to Venezuela in September, which led Washington to respond in kind.
ar: وكان تشافيز قد طرد المبعوث الامريكي في سبتمبر تضامنا مع بوليفيا، مما جعل واشنطن ترد بالمثل.

source: The dispute was over an alleged conspiracy to assassinate Bolivian President Evo Morales, a close friend of Chavez’.
ar: وكان الخلاف حول مؤامرة مفترضة لاغتيال الرئيس البوليفي ايفو موراليس، وهو صديق مقرب لتشافيز.

source: Obama shook hands for the second time during the summit; a clear indication that relationships were healing. He also accepted a book from the Venezuelan president.
ar: لكن اوباما الآن صافح تشافيز للمرة الثانية خلال القمة، في علامة واضحة على تحسن العلاقات، كما تلقى كتابا هدية من الزعيم الفنزويلي.

source: I thought it was one of Chavez's books, Obama told reporters afterwards. He soon discovered it was an original Spanish edition of Eduardo Galeano’s Open Veins of Latin America: Five Centuries of the Pillage of a Continent
ar: وظن اوباما عند استلام الكتاب من عند تشافيز انه من تاليفه، لكنه اكتشف فيما بعد انه النسخة الاصلية بالاسبانية لـعروق امريكا اللاتينية المفتوحة: خمسة قرون من نهب قارة لكاتبه ادواردو غاليانو.

source: I think President Obama is an intelligent man compared to the previous U.S. president, Chavez said.
ar: وقال تشافيز انها كانت لحظة جميلة، وانه يعتبر اوباما رجلا ذكيا، مقارنة بالرئيس الامريكي السابق.

source: American President Barack Obama had expressed his commitment to equality in partnership with Latin American nations.
ar: وكان الرئيس الاميركي باراك قد اوباما اعرب عن التزامه باقامة شراكة على قدم المساواة مع دول اميركا اللاتينية.

source: He said he believes in a new direction in relationships with Cuba, Chavez’ ally.
ar: واضاف اوباما انه يؤمن بامكانية اعطاء اتجاه جديد لعلاقات مع كوبا حليفة تشافيز.

source: Several Southern America leaders have praised Obama’s relationship reform plans during the summit.
ar: وقد اشاد عدد من قادة اميركا الجنوبية بالعلاقة الجديدة مع الولايات المتحدة اثر اول اجتماع مع باراك اوباما خلال القمة.

source: Rafael Correa, acting president of Ecuador, said that this was the beginning of a new era of relationships between South America and the United States.
ar: وقال رئيس الاكوادور رافاييل كوريا انها بداية عصر جديد مهمة جدا في العلاقات بين اميركا الجنوبية والولايات المتحدة.

source: Correa, Chavez, Morales, and Paraguayan President Fernando Logo are known to be long-time US critics.
ar: يشار الى ان كوريا وتشافيز ورئيس بوليفيا ايفو موراليس ورئيس الباراغواي فرناندو لوغو كانوا الاكثر عداء للولايات المتحدة.

source: Correa had stated the new American administration was open-minded. He said a change was yet to be seen in Cuba.
ar: واقر كوريا بكون الادارة الاميركية الجديدة اكثر انفتاحا، لكنه اضاف: لم نر بعد تغييرا كبيرا حيال كوبا.

source: Argentinean President Cristina Kirchner said that a different, integrated, and open dialogue took place between nations of the America continent. She said it was a good thing.
ar: ومن جهتها، اعتبرت رئيسة الارجنتين كريستينا كيرشنر ان حوارا مختلفا واكثر شمولية قد فتح بين دول القارة الاميركية، وقالت انه شيء جيد.

source: Chilean counterpart Michelle Bachelet said that the meeting was very positive and the dialogue was honest.
ar: واكدت نظيرتها التشيلية ميشيل باشيليه ان الاجتماع كان ايجابيا جدا والحوار صريحا.

source: Bachelet said that all presidents intend to take consideration of the past so the same mistakes are not repeated.
ar: وقالت باشليه: اعلن جميع الرؤساء انهم سيأخذون الماضي بالاعتبار كي لا ترتكب الاخطاء نفسها.

source: This first meeting was significant; twelve nations expressed hopes of a new beginning with the United States.
ar: وكان هذا اللقاء الاول مهما، حيث اعرب اعضاء اتحاد دول اميركا الجنوبية الـ12 عن الامل في بدء مرحلة جديدة مع الولايات المتحدة.

source: On a similar note, rapper Firas Maasrani considers his performance as critic art that has a goals and meanings, and must be recognized by official bodies because this will offer rappers great facilities in organizing concerts and being paid for them. “We
ar: في هذا السياق يعتبر مغني الراب فراس معصراني أن ما يقدمه فن ناقد وهادف وله معان ويجب أن تعترف به الهيئات الرسمية لأن ذلك يعطيهم تسهيلات جمة في إقامة حفلات رسمية ويتقاضون أجورا عن ذلك يقول فراس: « نتلقى نقدا شديدا وأحيانا يصل للتعنيف والاستهزاء بحجة أننا نغ

source: You rarely find a rapper who does not write his own lyrics. Rappers consider rap lyrics the most important element in the song, which needs a special talent, while a beautiful voice is not essential. The recording equipment is very basic, because well equ
ar: نادرا ما تجد مغني لا يكتب كلماته يعتبرون كتابة كلمات الراب أهم نقطة في الأغنية وهي تحتاج لموهبة خاصة حسب رأيهم بينما الصوت الجميل ليس أمرا ضروريا، أدوات تسجيل بسيطة جدا أما الاستوديوهات المعدة بشكل نظامي غالبا ما تتمركز بمدن كبيرة مثل دمشق أو حلب والبقية

source: ._Imad el-Helo is an audio engineer for a number of rap bands, and has a store to sell his tapes. According to him, young people -especially university students- are the main audience for rap songs and are constantly demanding them. However, there are no
ar: عماد الحلو هو تقني صوت لعدد من فرق الراب ولديه محل لبيع أشرطته قال أن الشباب وخصوصا طلاب الجامعات تُقبل بشكل كبير على سماع أغنيات الراب ولا يمر يوم دون أن يطلبها الشباب لكن لا يوجد تسجيلات وألبومات رسمية بسبب غياب شركات الإنتاج غالبا ما تنتقل عبر الفلاشات

source: Arab rap did not enter through the gate of the Syrian Opera House, but it reached a large segment of young people in the country and has developed a huge audience. Rappers are determined to continue, whether or not they get licensed and encouraged by the
ar: لم يدخل الراب العربي من بوابة دار الأوبرا السورية لكنه وصل إلى شريحة كبيرة من الشباب في البلاد وأصبح له جمهوره ومحترفيه وهم عاقدون العزم على الاستمرار سواء رخصت لهم الدولة مزاولة هذا الغناء وشجعتهم أم لا ...لأنهم ببساطة يقيمون حفلاتهم في الشارع.

source: Israeli police prevents Palestinian Christians from entering the Church of the Holy Sepulchre in Jerusalem
ar: الشرطة الإسرائيلية تمنع الفلسطينيين المسيحيين من دول كنيسة القيامة بالقدس

source: Saturday, April 18, 2009
ar: السبت إبريل 18 2009

source: Ramallah -
ar: رام الله -

source: - Jerusalem, DPA - Israeli authorities prevented Palestinian Christians on Saturday from entering the Church of the Holy Sepulchre in the old town of Jerusalem, and celebrating Saturday of Light.
ar: ، د ب أ - منعت السلطات الإسرائيلية السبت الفلسطينيين المسيحيين من دخول كنيسة القيامة في البلدة القديمة من القدس والاحتفال بـسبت النور الذي يصادف اليوم.

source: Dmitri Diliani, head of The National Christian Coalition, said that the Israeli police allowed only tourists and those who were transported in Israeli buses to enter the Church of the Holy Sepulchre, and celebrate Saturday of light, while it kept preventi
ar: وقال رئيس التجمع الوطني المسيحي ديمتري دلياني إن الشرطة الإسرائيلية تسمح فقط للسياح الأجانب والذين تم نقلهم إلى كنيسة القيامة بحافلات إسرائيلية بالدخول إلى كنيسة القيامة والاحتفال بسبت النور في الوقت الذي تواصل منع المسيحيين الشرقيين والفلسطينيين من الاحت

source: Clashes broke out today in the afternoon between Palestinians and the Israeli police in the surroundings of the Church of the Holy Sepulchre, in an attempt to break into the police barrier and enter the church to celebrate Saturday of light.
ar: واندلعت ظهر اليوم اشتباكات بالأيدي بين فلسطينيين في محيط كنيسة القيامة والشرطة الإسرائيلية في محاولة لاقتحام الحاجز الشِرطي والدخول إلى الكنيسة والاحتفال بسبت النور.

source: Diliani condemned the interference of the Israeli authorities in the affairs of the Christian church, stressing on the right of Palestinian Christians to celebration their feasts in their church without anyone's interference.
ar: واستنكر دلياني تدخل السلطات الإسرائيلية بشئون الكنيسة المسيحية ، مؤكدا حق المسيحيين الفلسطينيين الاحتفال بأعيادهم بكنيستهم دون تدخل.

source: For its part, the Palestinian presidency condemned strongly the Israeli actions preventing Christian clergy and worshipers from entering the Church of the Holy Sepulchre to celebrate their feast.
ar: من جهتها ، أدانت الرئاسة الفلسطينية بشدة الإجراءات الإسرائيلية المعيقة لدخول رجال الدين المسيحيين والمصلين لكنيسة القيامة للاحتفال.

source: The Palestinian presidency said in a press statement that the Israeli practices clearly reflect how the occupation authorities disregard all humanitarian norms and conventions which ensure freedom of worship for every human being on earth.
ar: وقالت الرئاسة ، في بيان صحفي ، تعكس الممارسات الإسرائيلية بوضوح استخفاف سلطات الاحتلال بكافة الأعراف والمواثيق الإنسانية التي تكفل حرية العبادة لكل إنسان على وجه الأرض.

source: It considered that the Israeli crime reached its peak by setting obstacles to Christian worshipers to prevent them from accessing places of worship, and beating Greek and Syriac clergymen in the yard of the church of the Holy Sepulchre, and breaking in t
ar: واعتبرت أن الإجرام الإسرائيلي بلغ ذروته بوضع العراقيل أمام المصلين المسيحيين والحيلولة دون وصولهم إلى أماكن عبادتهم، والاعتداء بالضرب بالهراوات على رجال الدين من طائفتي السريان والأقباط، في ساحة القيامة واقتحامها لكنيسة القيامة بالسلاح.

source: The Palestinian presidency called on all international, humanitarian and religious institutions to intervene to rein in this Israeli campaign.
ar: وناشدت كافة الأطراف الدولية والمؤسسات الإنسانية والدينية بالتدخل للجم هذه الحملة الإسرائيلية.

source: Damascus rejoices, suspect in Al Hariri assassination case detained
ar: نبأ سار لدمشق..اعتقال الشاهد الوحيد بقضية اغتيال الحريري

source: Moheet: Insight political sources revealed that Zahir Al Saddiq, a main witness in the former Lebanese Prime Minister Rafiq Al Hariri assassination case, was detained in the city of Sharjah a few days ago.
ar: محيط : كشفت مصادر سياسية مطلعة عن اعتقال زهير الصديق الشاهد الأساسي في قضية اغتيال رئيس الوزراء اللبناني الأسبق رفيق الحريري في إمارة الشارقة قبل أيام.

source: ‘Al Safir’ Lebanese newspaper reported that sources say this procedure took place based on a request from Syria to the Interpol to arrest Al Siddiq in the United Arab Emirates, especially since he possesses forged Syrian travel documents.
ar: ونقلت صحيفة السفير اللبنانية عن تلك المصادر القول إن هذا الإجراء جاء بعد أنباء وردت عن تقدم سوريا بطلب للشرطة الدولية الانتربول لتوقيف الصديق في دولة الإمارات العربية المتحدة ، خاصةً أنه يحمل وثيقة سفر سورية مزورة.

source: Al Siddiq had disappeared under mysterious circumstances in France. Fingers pointed at the intelligences of several nations amongst which was Syria. Al Siddiq had previously testified to the International Prosecution Committee that previous Lebanese Pre
ar: وكان الصديق اختفى في ظروف غامضة في فرنسا، ووجهت أصابع الاتهام إلى استخبارات دول عدة من بينها سوريا، خاصة أن الصديق سبق أن قال في شهادته أمام لجنة التحقيق الدولية إن الرئيس اللبناني السابق إميل لحود والرئيس السوري بشار الأسد أمرا باغتيال الحريري وإن المنظو

source: Damascus hopes that Al Siddiq’s arrest will assist the government in uncovering the truth.
ar: وتعول دمشق على أن توقيف الصديق سيساعد المحكمة الدولية على معرفة الحقيقة في اغتيال الحريري.

source: “The White House wants to hear Muslims”, Obama’s veiled advisor tells Al Bayan
ar: مستشارة أوباما المحجبة لـ «البيان»: البيت الأبيض يريد سماع رأي المسلمين

source: Dalia Migahed, Muslim advisor in the White House of Egyptian origin, said that her mission was to inform President Barack Obama of how Muslims think, what they seek from the United States, and to endorse understanding between Muslims in Europe and America
ar: أكدت داليا مجاهد (من أصل مصري) المستشارة المسلمة في البيت الأبيض أن مهمتها مركزة على إطلاع الرئيس باراك أوباما على كيفية تفكير المسلمين وماذا يريدون من الولايات المتحدة ودعم التقارب والتفاهم بين المسلمين في أوروبا وأميركا والعالم الإسلامي، وان هناك كثيرين

source: Dalia told Al Bayan that she anticipates the White House’s gesture in appointing a Muslim and veiled woman would project a positive image. She said this was not the first time a Muslim was appointed in the White House; several appointments were made in t
ar: وقالت داليا لـ «البيان» في اتصال هاتفي إنها تعتبر الخطوة التي اتخذها البيت الأبيض بتعيين سيدة مسلمة ومحجبة سيكون له صورة إيجابية، مشيرة إلى أنها «لست أول مسلمة تدخل البيت الأبيض، حيث سبق لعدد من المسلمين العمل في البيت الأبيض لكن هي المرأة الأولى التي يتم

source: Migahed stressed that the very foundation of her work was to inform President Obama on Muslim thinking methodologies and what Muslims seek from the United States. She said that Washington wants to hear Muslims, and that she believes she has the capabilit
ar: وشددت مجاهد على ان الأساس في عملها هو «إطلاع الرئيس أوباما كيف يفكر المسلمون وماذا يريدون من الولايات المتحدة»، وتابعت «إن الأساس الذي تم تعييني من أجله هو أنهم في واشنطن يريدون سماع آراء المسلمين، وأنا عندي تلك القدرة على إيصالها من خلال عملي في مركز (غا

source: On John Esposito’s recommendation for her appointment, Migahed said that he undoubtedly played a significant role based on what he knew of her ability to attain her goals. She also said she worked closely with Esposito on a book called: “Who speaks for I
ar: وحول دور جون إسبوزيتو في تعيينها في هذا المنصب بالبيت الأبيض قالت مجاهد «مما لا شك فيه أنه لعب دوراً في هذا الترشيح لما يعرفه عني من قدرة على الوصول لما أريد وقد عملنا سويا وألفنا كتابا مشتركا بعنوان «من يتكلم باسم الإسلام؟».

source: Upon being asked if she believed the initiative was late as Edward Djerejian, former US ambassador to Damascus from the James Baker Institute, had previously requested ex-President George Bush to appoint an Islamic affairs deputy. Djerejian’s requests we
ar: وحول ما إذا كانت تعتبر أن خطوة أوباما جاءت متأخرة بعد مطالبة السفير الأميركي الأسبق في دمشق إدوار جيرجيان من معهد جميس بيكر الرئيس السابق جورج بوش بتعيين نائب له لشؤون العالم الإسلامي بعد أحداث الحادي عشر من سبتمبر قالت «أستطيع القول لا، فقد كان هناك مسلم

source: London – Jamal Shaheen
ar: لندن - جمال شاهين

source: Al Bayan
ar: البيان

source: Cairo - Egyptian newspaper, al-Ahram, wrote Saturday that Iran, Syria, Qatar, Hamas and the Muslim Brotherhood are involved in the Hezbollah case and plotting a greater conspiracy against the Republic of Egypt.
ar: القاهرة- قالت صحيفة الاهرام المصرية السبت إن ايران وسوريا وقطر وحماس والأخوان المسلمين فيها متورطون بقضية حزب الله والتخطيط لمؤامرة كبرى ضدالجمهورية المصرية.

source: The newspaper said that the Hezbollah case was part of what it called the greater conspiracy against Egypt, in which the Lebanese organizations of Hezbollah, the Islamic resistance movement Hamas and the Muslim Brotherhood in Egypt were also involved, in
ar: وقالت الصحيفة ان قضية حزب الله كانت ضمن ما اسمته المؤامـرة الكـبرى ضد مصـر والتي تورطت فيها ايضا منظمات حزب الله اللبناني وحركة المقاومة الاسلامية (حماس) وجماعة الإخوان المسلمين في مصر‏ بالاضافة الى البوق الإعلامي قناة الجزيرة‏ الفضائية.

source: It pointed out that the Hezbollah case was not just about carrying out terrorist acts, but was the spark of revolution and disturbances as part of a greater plot against Egypt which have been carefully and maliciously weaved to disturb the internal securi
ar: واوضحت ان قضية حزب الله لم تكن القيام بأعمال إرهابية فقط‏‏ بل كانت البداية لإحداث ثورة وقلاقل ضمن مؤامرة كبرى على مصر خطط لها بعناية وبسوء نية للإخلال بالوضع الأمني داخل البلاد وإشاعة جو من الفوضي والبلبلة وتنفيذ أهدافهم الآثمة‏.

source: Al-Ahram mentioned that it is basing on the shocking facts that state apparatuses could obtain.
ar: واشارت الى انها تستند في معلوماتها الى الحقائق المفزعة التي وضعت أجهزة الدولة يدها عليها‏.

source: The national newspaper added that the beginning of military operations in the Gaza strip was at a previously determined and known time by the parties of the plot, indicating that Hamas determined the start of the Israeli military incursion on Gaza by sudd
ar: وقالت الصحيفة ان بدء العمليات العسكرية في قطاع غزة‏‏ كان توقيته معلوما‏‏ بل ومحدد سلفا لأطراف المؤامرة موضحة ان حماس حددت بدء الاجتياح العسكري الاسرائيلي لغزة، بإعلانها المفاجئ بعدم التزامها بوقف التهدئة‏ وأطلقت الصواريخ بشكل لم يكن مفهوما إلا لأطراف المؤ

source: According to the newspaper, Hamas’ stance reflected a great conspiracy agreed by the Brotherhood leadership in Egypt, their wings in Arab and European countries, their military wing which Hamas represents, Iran, Syria and Qatar. Each played a role that wa
ar: وتابعت ان موقف حماس عكس وجود خطة مؤامرة كبرى متفق عليها بين قيادة الاخوان في مصر واجنحتهم بالدول العربية والأوروبية وجناحها العسكري المتمثل في حماس‏ وأيضا تنظيم حزب الله وكل من إيران وسوريا وقطر وذلك وفق أدوار نسبت الى كل طرف وحددت معالمها بدقة‏‏ بل وتو

source: As for the Iranian role in the conspiracy, the newspaper said that it was represented in Hezbollah, of which its secretariat is the responsibility of the Shiite Hassan Nasr who is known to have close ties with the Syrian regime, which provided Hezbollah w
ar: وعن الدور الإيراني في المؤامرة قالت الصحيفة إنه تمثل في حزب الله الذي يتولى مسؤولية أمانته الشيعي حسن نصر والمعروف بعلاقاته الوطيدة بالنظام السوري الذي امد حزب الله باسلحته عقب جلائه من لبنان ودفعت ايران فاتورتها.

source: The newspaper added that Iran moved through its axes, through an official media and statements by the president, through exporting Grad rockets to Hamas, besides the works agenda in Egypt.
ar: واضافت الصحيفة ان ايران تحركت عبر محاورها من خلال إعلام رسمي وتصريحات رئيس نظامها وتصديرها لصواريخ غراد لحماس‏‏ فضلا عن تحركات للقائمة بالأعمال في مصر‏ وتبعه في كل الأدوار حزب الله وأمينه العام‏.

source: Adel al-shueibi. Lies
ar: عادل الشعيبي - افترائات ا

source: Maher - Makes sense.
ar: ماهر - منطقي

source: Jamal-Palestine - Shame on you, Egypt
ar: جمال - فلسطين - اخجلي يا مصر

source: All who have been accused in al-Ahram newspaper are in enmity with Israel, which goes to prove the falsity of such allegations. Who would push Egypt to be against its fellow brothers except Israel? The question is, how did Israel manage to regain the Egyp
ar: كل المتهمين في صحيفة الاهرام هم اعدا اسرائيل وهذا يعتبر دليل على كذب هذة المزاعم فمن يدفع بمصر لمعاداة اخوتة غير اسرائيل والاستغراب هو كيف استطاعت اسرائيل ان تستعبد وتسير النضام المصري كدمية بيدها

source: Honestly, I did read al-Ahram, and the report seems logical. If we review the events closely since the truce was ended by Syria, and al-Jazeerah starting inciting against Egypt more than Israel did, assuming that the crossing is the issue, and then there
ar: بصراحه طالعت الاهرام والتقرير منطقي لو راجعنا الاحداث بدقه منذ الغاء الهدنه من سوريا وتحريض الجزيرة على مصر اكثر من اسرائيل باغعتبار المعبر هو القضيه ومن ثم موقف حماس وخطاب حسن نصرالله وباقي الامور ..التقرير منطقي .

source: Looks like the abyss that the languid Egyptian regime, which is conniving with Israel, has fallen to is bottomless. If Israel fails to military finish off Hezbollah and the Palestinian resistance, that’s fine, Egypt will take over.
ar: يبدو وانه لا حدود للهاوية التي سقط بها النظام المصري المتاخذل والمتواطيئ مع اسرائيل وسياستها فاذا فشلت اسرائيل عسكريا في القضاء على حزب الله وقوى المقاومة الفلسطينية عسكريا فلا باس مصر ستكمل المهمة.

source: Recently, a number of families that live among us, disguised as Muslims while embracing Jewish beliefs and transmit them from one generation to the other in order to preserve their interests, have emerged. But at the times of war with the enemies we find
ar: في الآونة الأخيرة بدءنا نتكشف العديد من العائلات التي تعيش بين ظهرنينا يرتدون ثوب الاسلام ومازالوا يبطنون العقيدة اليهودية ويتوارثونها جيلا بعد الأخر حفاظا على مصالحهم , ولكنهم في وقت الملاحم في حروبنا مع الاعداء نجدهم يحشدون جهودهم لخلق البلبلة بين المسل

source: The newspaper forgot about Chavez, Erdogan and Galloway and those who say that there is no God but Allah. What the newspaper says implies that Egypt is in a state of chaos while in reality security is in total control of things. But authorities in Egypt t
ar: الجريده نسيت شافيز واردوغان وجالوي وكل من قال لا اله الا الله والله جريدة الهيك ما سوتها بنفهم من هيك انو مصر فوضى وكلام الجريده بدلل على ذلك مع انه الامن مسيطر على الشعب سيطره مطلقه لكن السلطه في مصر اسد علي وفي الحروب نعامة . اسرائيل والغرب يسيطر سيطره

source: It is funny to say that security is in total control of the Egyptian people because we all know that Syrian people and the people of most of the Arab countries are the ones under the control of the security (we all remember what happened to that Jordanian
ar: من المضحك أن تقول أن الأمن يسيطر على الشعب المصري, لأننا جميعا نعلم أن شعوب سوريا و معظم الأقطار العربية هي الواقعة تحت سيطرة الأمن (نتذكر جميعا ما حدث للأردني الذي سأل عن قصر الرئيس السوري).

source: If you’re up to comparison, you’d better compare the ceiling of freedom in Egypt and that in the rest of the Arab states.
ar: وإذا أردت المقارنة فعليك المقارنة بين سقف الحرية في مصر و بين سقف الحرية في بقية الدول العربية.

source: Let us not forget th
ar: و دعنا لاننسى أن دول الممانعة المزعومة-تمنعن وهن ......-تتفانى منذ سنوات في لعقد اتفاقيات سلام مع اسرائيل تحت رعاية أمريكا و ليس أي دولة أخرى.

source: Besides, during the war on Gaza, all they did was weeping and attacking the largest Arab state (knowing that Egypt was almost the only Arab state that really did efforts to stop that war)
ar: كما أنه خلال الحرب على غزة اكتفت بالعويل و التهجم على أكبر الدول العربية (مع العلم أن مصر كانت الدولة العربية الوحيدة تقريبا التي بذلت جهدا فعليا لوقف الحرب).
